In [11]:
import pandas as pd

In [14]:
df = pd.DataFrame({
    'ID':[1,2,3,4,5],
    'NOMBRE':['Ana','Luis','Carlos','Sofia',None],
    'EDAD':[25,30,'TREINTA Y CINCO',40,45],
    'GENERO':['F','M','M','F','M'],
    'SALARIO':[5000,None,6000,5500,7000],
    'DEPARTAMENTO':['Ventas','Marketing','Ventas','RRHH','TI'],
})
df

   ID  NOMBRE             EDAD GENERO  SALARIO DEPARTAMENTO
0   1     Ana               25      F   5000.0       Ventas
1   2    Luis               30      M      NaN    Marketing
2   3  Carlos  TREINTA Y CINCO      M   6000.0       Ventas
3   4   Sofia               40      F   5500.0         RRHH
4   5    None               45      M   7000.0           TI

In [15]:
# Verificamos valores nulos en el dataframe
df.isnull().sum()

ID              0
NOMBRE          1
EDAD            0
GENERO          0
SALARIO         1
DEPARTAMENTO    0
dtype: int64

df_sin_nulos=df.dropna()